[
  {
    "id": "056ce8a5-7520-448a-a0a6-fa954bb6e1f2",
    "type": "Full Time",
    "url": "https://www.google.com/search?q=climate+change+jobs&oq=climate+change+jobs&aqs=chrome..69i57j69i60j0l4.4935j1j4&sourceid=chrome&ie=UTF-8&ibp=htl;jobs&sa=X&ved=2ahUKEwj0rdft_KXjAhUitlkKHYjKBa0QiYsCKAF6BAgJEBA#fpstate=tldetail&htidocid=BszOAf0kiqFKjXeuAAAAAA%3D%3D&htivrt=jobs",
    "created_at": "Thu Jun 13 20:38:32 UTC 2019",
    "company": "Rainforest Alliance",
    "company_url": "https://rainforest-alliance.org/",
    "location": "New York, NY",
    "title": "Global Lead Climate Change",
    "description": "The Global Lead Climate Change advises and supports our strategy on climate change adaptation and mitigation as follows: • Provide dynamic and creative leadership and coordination for the development and implementation of Rainforest Alliance’s innovative global field strategies for climate change adaptation and mitigation and its landscape approaches; • Co-lead innovative program, project, and proposal design and development for climate change adaptation and mitigation in the context of landscape interventions and support the implementation of field programs and projects within these areas of expertise; • Support overall fundraising strategy, including cultivation and support for key partner, company and donor relationships; • Work effectively with other theme leads and technical staff across the organization as well as externally to advance Rainforest Alliance’s overall mission and strategy.",
    "how_to_apply": "https://www.linkedin.com/jobs/view/global-lead-climate-change-at-rainforest-alliance-1331865039?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "company_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTJql2HH0gdyzr8DDTClAQamm-TbleHARJ2Mx3MqAHjJpk2DbOwrkQa2g"
  },
  {
    "id": "10e61b1c-1d2b-43ed-bf5d-c261020378f1",
    "type": "Full Time",
    "url": "https://www.google.com/search?q=climate+change+jobs&oq=climate+change+jobs&aqs=chrome..69i57j69i60j0l4.4935j1j4&sourceid=chrome&ie=UTF-8&ibp=htl;jobs&sa=X&ved=2ahUKEwj0rdft_KXjAhUitlkKHYjKBa0QiYsCKAF6BAgJEBA#fpstate=tldetail&htidocid=UPcfemp-srwOLHsvAAAAAA%3D%3D&htivrt=jobs",
    "created_at": "Tue Jun 04 19:53:36 UTC 2019",
    "company": "Council on Foreign Relations",
    "company_url": "https://www.cfr.org/",
    "location": "New York, NY",
    "title": "Senior Fellow for Climate Change Policy",
    "description": "The David Rockefeller Studies Program at the Council on Foreign Relations (CFR) is seeking to hire a senior fellow for climate change. The fellow will be expected to conduct original research and writing on what should be done to prevent and mitigate the consequences of climate change. This is an extraordinary opportunity for an individual looking to shape the national conversation on what the federal government, state and local businesses, companies, and individuals should do to minimize and possibly reverse the damage done by a changing climate. The major responsibilities of this position will include (but are not limited to): • Writing books, articles, and op-eds. • Organizing and leading roundtables, study groups, and workshops at CFR on climate change, its economic, political, and social consequences, and possible responses. • Interacting with CFR’s distinguished membership and participating in CFR programs and activities. • Meeting with administration officials, members of Congress, their staffs, and other relevant groups to brief them on research findings and recommendations. • Educating a broader public audience through media interviews and public speaking. • Developing fundraising proposals for the program in collaboration with senior staff.",
    "how_to_apply": "https://careers-cfr.icims.com/jobs/1419/senior-fellow-for-climate-change-policy/job?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "company_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSij54Hkgfs-8xQXnaxVVx_YO2pH0VaOlAGycirEaLZkiMNII27xJg"
  },
  {
    "id": "7b0278ca-0180-435b-9a13-913a6668390a",
    "type": "Full Time",
    "url": "https://www.google.com/search?q=climate+change+jobs&oq=climate+change+jobs&aqs=chrome..69i57j69i60j0l4.4935j1j4&sourceid=chrome&ie=UTF-8&ibp=htl;jobs&sa=X&ved=2ahUKEwj0rdft_KXjAhUitlkKHYjKBa0QiYsCKAF6BAgJEBA#fpstate=tldetail&htidocid=u5X_WpJfzx0XeEWDAAAAAA%3D%3D&htivrt=jobs",
    "created_at": "Tue Jun 04 19:45:53 UTC 2019",
    "company": "Xerox Corporation",
    "company_url": "https://www.xerox.com/",
    "location": "New York, NY",
    "title": "Energy and Climate Change Specialist",
    "description": "Xerox Corporation (NYSE: XRX) is an $11 billion technology leader that innovates the way the world communicates, connects and works. Our expertise is more important than ever as customers of all sizes look to improve productivity, maximize profitability and increase satisfaction. We do this for small and mid-size businesses, large enterprises, governments, graphic communications providers, and for our partners who serve them. We understand what's at the heart of work - and all of the forms it can take. We embrace the increasingly complex world of paper and digital. Office and mobile. Personal and social. Every day across the globe - in more than 160 countries - our technology, software and people successfully navigate those intersections. We automate, personalize, package, analyze and secure information to keep our customers moving at an accelerated pace. Learn more at www.xerox.com and explore our commitment to diversity and inclusion! Corporate subject matter expert on climate change and carbon related to Xerox marketed products, supply chain and global operations. This position requires interfacing with internal and external stakeholders as indicated below: Xerox Sales, Marketing and Customers: Develop and implement tools that allow accurate and efficient estimation of the sustainability benefits of Xerox products and solutions Communicate the sustainability benefits of Xerox products and solutions at Executive Customer Engagements and other customer-facing forums. Satisfy external stakeholders' expectations for carbon footprint information (e.g. Life Cycle Assessment) and communicate results. Global Operations: Collect, compile, manage and analyze greenhouse gas emissions and energy associated with Xerox facilities and machines in the field. Develop short and long-term goals, with targets, and track progress to plan. Populate sustainability databases such as CDP, DJSI, etc., analyze results and recommend areas for improvements. Assume responsibility for 3rd party assurance of energy and greenhouse gas data. Benchmark best-in-class methods and make recommendations to enhance data collection and reporting methods. Supply Chain and Procurement: Identify opportunities to advance Xerox contributions to a circular economy and participate in the development of strategies and implementation plans. Lead supplier engagement activities, working with suppliers and global procurement on baselining performance, audits and the correction of non-conformance, and setting goals. Additionally, the Energy and Climate Change Specialist will engage with various other Xerox organizations, including finance, real estate, and legal, to mitigate corporate risks associated with climate change and develop a comprehensive climate change strategy.Qualifications: BS degree in a technical discipline. MS degree in Environmental Sustainability, or associated field, and/or MBA preferred. At least 5 years of applied environmental sustainability experience, including project management, data collection and reporting. Strong analytical skills and ability to conduct research, analyze and synthesize data. Demonstrated business development skills with a sustainability context. Strong verbal and written communication skills. Well-developed interpersonal skills and can interact within all levels of the organization. Experience in supply chain sustainability, supply chain risk, with exposure and interest in innovated technology solutions to drive sustainability goals. Well versed in UN Sustainable Development goals and Circular Economy with practical experience. Detailed knowledge of challenges surrounding climate change, energy, greenhouse gas emissions, and sustainability. Working knowledge of carbon accounting standards (ISO 14064, GHG Protocol and variants). Proficiency in Microsoft Office applications and experience using sustainability calculators and software packages. Xerox is an Equal Opportunity Employer and considers applicants for all positions without regard to race, color, creed, religion, ancestry, national origin, age, gender identity, sex, marital status, sexual orientation, physical or mental disability, use of a guide dog or service animal, military/veteran status, citizenship status, basis of genetic information, or any other group protected by law. People with disabilities who need a reasonable accommodation to apply or compete for employment with Xerox may request such accommodation(s) by sending an e-mail to XeroxStaffingAdminCenter@xerox.com. Be sure to include your name, the job you are interested in, and the accommodation you are seeking",
    "how_to_apply": "https://www.ziprecruiter.com/c/Xerox-Corporation/Job/Energy-and-Climate-Change-Specialist/-in-New-York,NY?ojob=dc35318dda45de0dcfa56cbdfe7bc021&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "company_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSDy_uPIpNspspMeKmQs_4HYwBdOPPm8VtGzBWiHO7_4N5Ci6GNc4g"
  },
  {
    "id": "45296f64-ec32-11e8-9e1b-5d24b20f1c0f",
    "type": "Full Time",
    "url": "https://www.google.com/search?q=climate+change+jobs&oq=climate+change+jobs&aqs=chrome..69i57j69i60j0l4.4935j1j4&sourceid=chrome&ie=UTF-8&ibp=htl;jobs&sa=X&ved=2ahUKEwj0rdft_KXjAhUitlkKHYjKBa0QiYsCKAF6BAgJEBA#fpstate=tldetail&htidocid=UiQVaJWWLdvNOhjwAAAAAA%3D%3D&htivrt=jobs",
    "created_at": "Mon Nov 19 19:40:01 UTC 2018",
    "company": "Prosek Partners",
    "company_url": "https://www.nyc.gov",
    "location": "New York, NY",
    "title": "Senior Policy Advisor",
    "description": "About the Office:  In New York City, we recognize that climate change is not just an environmental issue; it’s a societal issue that requires a new social compact – one that supports growth, while advancing human rights, public health, and economic prosperity for all. In April 2019, Mayor Bill de Blasio released OneNYC 2050: New York City’s Green New Deal and long-term strategy. OneNYC 2050 provides a blueprint to confront our climate crisis, achieve equity, and strengthen our democracy. New York City is already demonstrating its commitment to confront the climate crisis and fight for climate justice. We have committed to achieving carbon neutrality – which means a 100% reduction in net greenhouse gas emissions – by 2050. We are investing over $20 billion to protect our people and strengthen our communities, buildings, infrastructure, and waterfront to be more resilient to the impacts of climate change. We are creating good-paying and accessible jobs through our climate action and are ensuring that the transition to carbon neutrality, climate resiliency, and a clean economy is just and equitable, so that no community bears a disproportionate environmental burden or is left behind. We are taking the fight straight to the fossil fuel industry for their role in creating this climate crisis by suing the five investor-owned fossil fuel companies most responsible for climate change, divesting the City’s pension funds from fossil fuels, and investing in climate solutions. And we are working with cities around the nation and around the world to scale up climate action efforts and share tools, knowledge, and best practices, to ensure climate change is addressed at a global scale.  The Mayor’s Office of Climate Policy and Programs leads New York City’s fight against climate change and manages the OneNYC program from within the First Deputy Mayor’s office.  About the Role: The Office of Climate Policy and Programs is seeking a Senior Policy Advisor. The ideal candidate has strong experience in project management and knowledge of climate policy; some experience in government, not for profit, or advocacy organizing; and is eager to learn how to leverage policy making to create opportunities and positive change for New Yorkers.",
    "how_to_apply": "https://www.idealist.org/en/amp/government-job/2868df7df94c42ad9714185bb05fe193-senior-policy-advisor-city-of-new-york-new-york?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "company_logo": ""
  },
  {
    "id": "fda26124-e9e7-11e8-9f44-4d0452dab2f9",
    "type": "Full Time",
    "url": "https://www.google.com/search?q=climate+change+jobs&oq=climate+change+jobs&aqs=chrome..69i57j69i60j0l4.4935j1j4&sourceid=chrome&ie=UTF-8&ibp=htl;jobs&sa=X&ved=2ahUKEwj0rdft_KXjAhUitlkKHYjKBa0QiYsCKAF6BAgJEBA#fpstate=tldetail&htidocid=W-gqK5e1QFaaDNsqAAAAAA%3D%3D&htivrt=jobs",
    "created_at": "Fri Nov 16 21:43:59 UTC 2018",
    "company": "InsideClimate News",
    "company_url": "https://insideclimatenews.org/",
    "location": "New York, NY",
    "title": "Award-Winning InsideClimate New Is",
    "description": "InsideClimate News is looking for a talented reporter who can write fast and with authority about climate change and energy issues for our news site and social media.  This is an entry-level position based in New York City. It is an exciting opportunity to work closely with an award-winning team of journalists and develop expertise in one of the hottest, most important topics of our time.  We see this as a key position to complement our investigative work as climate change emerges as a defining issue in the national political conversation. We're looking for an ambitious self-starter, someone who is hungry to create buzz and react to it, who wakes up eager to find out what happened and what's next. This reporter must feel comfortable writing short but incisive news stories daily, while juggling social media engagement and other work.  The ideal candidate has a proven ability to work independently, manage multiple tasks with accuracy, and meet deadlines in a fast-paced environment. You must prize accuracy, rigor and attention to detail and have a keen interest in climate change, energy and environmental justice issues and a passion for the kind of hard-hitting public interest journalism ICN delivers.",
    "how_to_apply": "https://www.linkedin.com/jobs/view/award-winning-insideclimate-news-is-seeking-news-reporter-at-insideclimate-news-1297235034?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "company_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ6yZ0gY6CgYxBV2ULwTSrAAvT6ooBGCht5vvsN3vt8Yg8_iDkLe13RXw"
  },
  {
    "id": "d28b2d1a-e85a-11e8-9b78-62dc829f5516",
    "type": "Full Time",
    "url": "https://www.google.com/search?q=climate+change+jobs&oq=climate+change+jobs&aqs=chrome..69i57j69i60j0l4.4935j1j4&sourceid=chrome&ie=UTF-8&ibp=htl;jobs&sa=X&ved=2ahUKEwj0rdft_KXjAhUitlkKHYjKBa0QiYsCKAF6BAgJEBA#fpstate=tldetail&htidocid=se7GmsfCEHrh_GTlAAAAAA%3D%3D&htivrt=jobs",
    "created_at": "Wed Nov 14 22:16:02 UTC 2018",
    "company": "UNDP",
    "company_url": "http://www.undp.org/",
    "location": "New York, NY",
    "title": "Individual Consultant-National Climate",
    "description": "The objective of the GEF PPG is to develop the project concept into a full project: Capacity-building for establishing an Integrated and Enhanced Transparency Framework for Climate actions and support measures. As described in the project concept (PIF), this project aims to strengthen the existing institutional capacity and enable them to monitor, verify, and report relevant information pertaining to climate reporting, viz: GHG emissions; progress with climate actions as appropriated under NDCs; capacity-needs, gaps, constraints; and corresponding support received and required.",
    "how_to_apply": "https://www.glassdoor.com/job-listing/individual-consultant-national-climate-change-and-transparency-expert-undp-JV_IC1132348_KO0,69_KE70,74.htm?jl=3281372748&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "company_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTwXVoEBxe_1SGgUEkCqcGHjWbJU64YAojjKdOaFI1QIskAoT75BJH0wg"
  },
  {
    "id": "0e9e93a6-e85a-11e8-8963-f68a643e24dd",
    "type": "Full Time",
    "url": "https://www.google.com/search?q=climate+change+jobs&oq=climate+change+jobs&aqs=chrome..69i57j69i60j0l4.4935j1j4&sourceid=chrome&ie=UTF-8&ibp=htl;jobs&sa=X&ved=2ahUKEwj0rdft_KXjAhUitlkKHYjKBa0QiYsCKAF6BAgJEBA#fpstate=tldetail&htidocid=JZkFTcit7EL1eKCpAAAAAA%3D%3D&htivrt=jobs",
    "created_at": "Wed Nov 14 22:11:05 UTC 2018",
    "company": "Business for Social Responsibility",
    "company_url": "http://www.bsr.org/",
    "location": "New York, NY",
    "title": "Manager, Infrastructure and Climate Change",
    "description": "BSR is a global nonprofit organization that works with its network of more than 250 member companies and other partners to build a just and sustainable world. From its offices in Asia, Europe, and North America, BSR develops sustainable business strategies and solutions through consulting, research, and cross-sector collaboration. Visit www.bsr.org for more information about BSR’s 25 years of leadership in sustainability.  We are proud to say that we have a team of some of the most talented and motivated people in the industry working in our global offices in Copenhagen, Guangzhou, Hong Kong, New York, Paris, San Francisco, Shanghai, and Tokyo.  BSR is also a founding partner of the We Mean Business coalition, a group of business-facing networks and think tanks that collectively works with thousands of businesses and investors to accelerate the transition to a low carbon economy. BSR is proud to play an active role in the policy engagement, corporate engagement, and communications work of the coalition.",
    "how_to_apply": "https://www.sustainablebusiness.com/job/297-5/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "company_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTXuwbWmcCl4ceTY8hqGJcwQh1be1RlkdSaUyxAlZPf_EmxoHHL0nqtqQ"
  },
  {
    "id": "dc428b94-e42e-11e8-91e2-23879ca9e8b0",
    "type": "Full Time",
    "url": "https://www.google.com/search?q=climate+change+jobs&oq=climate+change+jobs&aqs=chrome..69i57j69i60j0l4.4935j1j4&sourceid=chrome&ie=UTF-8&ibp=htl;jobs&sa=X&ved=2ahUKEwj0rdft_KXjAhUitlkKHYjKBa0QiYsCKAF6BAgJEBA#fpstate=tldetail&htidocid=0w2GJ4g7QtbPCzHuAAAAAA%3D%3D&htivrt=jobs",
    "created_at": "Fri Nov 09 14:51:11 UTC 2018",
    "company": "Council on Foreign Relations",
    "company_url": null,
    "location": "New York, NY",
    "title": "Senior Fellow for Climate Change Policy",
    "description": "The David Rockefeller Studies Program at the Council on Foreign Relations (CFR) is seeking to hire a senior fellow for climate change. The fellow will be expected to conduct original research and writing on what should be done to prevent and mitigate the consequences of climate change. This is an extraordinary opportunity for an individual looking to shape the national conversation on what the federal government, state and local businesses, companies, and individuals should do to minimize and possibly reverse the damage done by a changing climate.",
    "how_to_apply": "https://www.linkedin.com/jobs/view/senior-fellow-for-climate-change-policy-new-york-at-council-on-foreign-relations-1229586437?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "company_logo": null
  },
  {
    "id": "fa15462c-e201-11e8-9ee9-cfbf28397977",
    "type": "Full Time",
    "url": "https://www.google.com/search?q=climate+change+jobs&oq=climate+change+jobs&aqs=chrome..69i57j69i60j0l4.4935j1j4&sourceid=chrome&ie=UTF-8&ibp=htl;jobs&sa=X&ved=2ahUKEwj0rdft_KXjAhUitlkKHYjKBa0QiYsCKAF6BAgJEBA#fpstate=tldetail&htidocid=21bFE-HDKD-Ee67xAAAAAA%3D%3D&htivrt=jobs",
    "created_at": "Tue Nov 06 20:25:06 UTC 2018",
    "company": "Tiffany & Co.",
    "company_url": "https://www.tiffany.com/",
    "location": "New York, NY",
    "title": "Manager, Climate & Environment",
    "description": "The Manager, Climate & Environment works with the Director, Global Sustainability and key internal functions to drive Tiffany’s global energy & climate strategy and the company’s environmental strategy more broadly. The Manager will be responsible for advancing the company’s approach, for developing business cases, and for facilitating cross-functional collaboration to support implementation and help the company achieve its energy, climate and environmental goals. The Manager, Climate & Environment partners with key internal functions such as Real Estate, Finance, Retail, Manufacturing, Environment, Health & Safety (EHS) and Responsible Sourcing to provide input on various environmental initiatives, and participates in external engagements and collaborations as relevant. The Manager reports to the Director, Global Sustainability.",
    "how_to_apply": "https://www.linkedin.com/jobs/view/manager-climate-environment-at-tiffany-co-1241370143?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "company_logo": null
  },
  {
    "id": "36bb2228-e201-11e8-9310-b526bfa5a16e",
    "type": "Full Time",
    "url": "https://www.google.com/search?q=climate+change+jobs&oq=climate+change+jobs&aqs=chrome..69i57j69i60j0l4.4935j1j4&sourceid=chrome&ie=UTF-8&ibp=htl;jobs&sa=X&ved=2ahUKEwj0rdft_KXjAhUitlkKHYjKBa0QiYsCKAF6BAgJEBA#fpstate=tldetail&htidocid=IaqslSKV8RpA5LuQAAAAAA%3D%3D&htivrt=jobs",
    "created_at": "Tue Nov 06 20:19:44 UTC 2018",
    "company": "ICF",
    "company_url": "https://www.icf.com/",
    "location": "New York, NY",
    "title": "Climate Change and Sustainability Specialist",
    "description": "Working at ICF means applying a passion for meaningful work with intellectual rigor to help solve the leading issues of our day. Smart, compassionate, innovative, committed, ICF employees tackle unprecedented challenges to benefit people, businesses, and governments around the globe. We believe in collaboration, mutual respect, open communication, and opportunity for growth. If you’re seeking to make a difference in the world, visit www.icf.com/careers to find your next career. ICF—together for tomorrow.  It's not hard to come to work each day when you're preventing pollution, saving energy, and helping the world mitigate and become more resilient to impacts from climate change. ICF is at the forefront of preparing leading-edge technical and policy analyses, identifying viable market solutions, building real-world management tools, and implementing programs to reduce greenhouse gas emissions. In climate change and environmental markets, ICF has advised more than 30 governments and international institutions, and served more than 60 companies in the FT Global 500. We develop emissions inventories and carbon footprints; conduct greenhouse gas mitigation policy analyses; assist clients with offset and carbon credit projects; support organizational sustainability; assess the performance of global programs (e.g., climate funds, multilateral development banks), and identify ways they could improve; and support federal, state, local, international, and private sector clients on analyses related to climate change impacts and vulnerabilities, among other service offerings. We offer our clients around the globe unparalleled analytical, policy, and business management services.  ICF is seeking an environmental consultant to support our Climate, Energy Efficiency, and Transportation line of business. You will be responsible for supporting ICF managers in winning, planning, and executing projects. You will be expected to work as part of 2 to 7 person teams to execute tasks related to the development and delivery of accurate, timely, and high quality products and services. You are likely to work on multiple projects, interact with all levels of staff, and have some client interaction. At ICF you have an opportunity to apply your academic knowledge, gain exposure to major projects, and interact with experts and clients in the field, while also building content knowledge and consulting skills.",
    "how_to_apply": "https://www.icf.com/careers/jobs/r1900392?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "company_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRLxugpwGUSIY2lTViqX6NgnbM-rYqVENgQmx6ABNsc2bhvV2YzaV_ETA"
  },
  {
    "id": "cdd3b306-ded1-11e8-9d57-a9ea0396f64e",
    "type": "Full Time",
    "url": "https://www.google.com/search?q=climate+change+jobs&oq=climate+change+jobs&aqs=chrome..69i57j69i60j0l4.4935j1j4&sourceid=chrome&ie=UTF-8&ibp=htl;jobs&sa=X&ved=2ahUKEwj0rdft_KXjAhUitlkKHYjKBa0QiYsCKAF6BAgJEBA#fpstate=tldetail&htidocid=48oTpkFLJRHWt4hyAAAAAA%3D%3D&htivrt=jobs",
    "created_at": "Fri Nov 02 19:02:51 UTC 2018",
    "company": "Earthjustice",
    "company_url": "earthjustice.org",
    "location": "New York, NY",
    "title": "Staff Attorney, Climate and Energy",
    "description": "Earthjustice is seeking an experienced attorney to join the Climate and Energy team in its Northeast office. The Climate and Energy work is at the heart of Earthjustice’s efforts to cut greenhouse gas emissions and prevent catastrophic climate change. The attorney selected for this position will work closely with other professionals (attorneys, policy analysts, communications experts) to force a shift from dirty to clean energy. The position will be based in our office in New York City.  Earthjustice is the premier nonprofit environmental law organization. We take on the biggest, most precedent-setting cases across the country. We wield the power of law and the strength of partnership to protect people’s health; to preserve magnificent places and wildlife; to advance clean energy; and to combat climate change. We partner with thousands of groups and supporters to engage the critical environmental issues of our time, and bring about positive change. We are here because the earth needs a good lawyer.  Founded in 1971, Earthjustice has a distinguished track record of achieving significant, lasting environmental protections. We achieve this by hiring people who share a passion for justice and a healthy environment. Our headquarters are in San Francisco with offices in Anchorage, Juneau, Los Angeles, Miami, Tallahassee, Honolulu, New York, Philadelphia, Denver, Seattle, Bozeman, and Washington, DC.  The Climate and Energy work in the Northeast Office uses litigation and administrative advocacy to end the region’s reliance on fossil fuels and speed the transition to clean, renewable energy for power generation, home heating and cooking, and transportation. Our docket includes involvement in utility ratemaking proceedings in Albany, litigation to prevent construction of additional fossil fuel infrastructure, and other advocacy activities to foster a more rapid change to a zero emission future, especially in New York and New Jersey.  Applicants must be ready and able to develop and lead litigation from day one. The ideal candidate for this position will have extensive and successful experience with most aspects of judicial and administrative proceedings—including developing cases, conducting discovery, assisting with expert reports, motion practice, evidentiary hearings, and post-hearing briefing. We offer a mission-and employee-focused work environment and a competitive compensation package, including excellent benefits. Earthjustice is an equal opportunity employer and highly values diversity.",
    "how_to_apply": "https://earthjustice.org/about/jobs/37802/staff-attorney-climate-and-energy?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "company_logo": "http://t0.gstatic.com/images?q=tbn:ANd9GcQxBiqtOoHVSXa4kn7o_--tRpbrrExxyswkj_WTWTSgEitjSqH_"
  },
  {
    "id": "cdd3b306-ded1-11e8-9d57-a9ea0396f64e1",
    "type": "Full Time",
    "url": "https://www.google.com/search?q=climate+change+jobs&oq=climate+change+jobs&aqs=chrome..69i57j69i60j0l4.4935j1j4&sourceid=chrome&ie=UTF-8&ibp=htl;jobs&sa=X&ved=2ahUKEwj0rdft_KXjAhUitlkKHYjKBa0QiYsCKAF6BAgJEBA#fpstate=tldetail&htidocid=AUltAvhReo7FL439AAAAAA%3D%3D&htivrt=jobs",
    "created_at": "Fri Nov 02 19:02:51 UTC 2018",
    "company": "Environmental Resources Management",
    "company_url": "http://www.erm.com/",
    "location": "New York, NY",
    "title": "Environmental Air Quality Engineer/Task Manager (Associate)",
    "description": "ERM is seeking a motivated Air Quality Engineer/Task Manager to join our consulting team in Manhattan, NY. The successful candidate will work on a variety of interesting technical projects for clients in the power generation, oil & gas, and other energy sectors across the US, with increasing responsibility for task/project management duties.\nERM’s Air Quality & Climate Change technical community pursues and wins highly innovative engagements for the most interesting clients, providing the full breadth of air quality and climate change services. With annual global sales in excess of $50 million, ERM's Air Quality & Climate Change service area is one of the largest among its peers in our industry and is steadily growing at a double-digit pace. In North America alone, ERM has more than 300 dedicated air quality and climate change professionals assisting clients with projects as diverse as developing responses to emerging Low Carbon Fuel Standards, to leading complex capital projects through the many hurdles associated with the NSR permitting program.\nThis is an excellent career opportunity to work with an expert consulting team on challenging environmental management projects for large industrial and global clients. Access to ERM's national Air Quality & Climate Change experts provide knowledge sharing of best practices across the industry and ongoing learning opportunities for our team.",
    "how_to_apply": "https://www.linkedin.com/jobs/view/environmental-air-quality-engineer-task-manager-associate-at-erm-environmental-resources-management-1057307953?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "company_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRcCrnxCvyHowZK714YzaFbJKZbz3LTKdUfq1qDQfB-SviO4QXRFZYQYg"
  },
  {
    "id": "cdd3b306-ded1-11e8-9d57-a9ea0396f64e2",
    "type": "Full Time",
    "url": "https://www.google.com/search?q=climate+change+jobs&oq=climate+change+jobs&aqs=chrome..69i57j69i60j0l4.4935j1j4&sourceid=chrome&ie=UTF-8&ibp=htl;jobs&sa=X&ved=2ahUKEwj0rdft_KXjAhUitlkKHYjKBa0QiYsCKAF6BAgJEBA#fpstate=tldetail&htidocid=se7GmsfCEHrh_GTlAAAAAA%3D%3D&htivrt=jobs",
    "created_at": "Fri Nov 02 19:02:51 UTC 2018",
    "company": "UNDP",
    "company_url": "http://www.undp.org/",
    "location": "New York, NY",
    "title": "Individual Consultant- National Climate Change and Transparency Expert",
    "description": "The objective of the GEF PPG is to develop the project concept into a full project: Capacity-building for establishing an Integrated and Enhanced Transparency Framework for Climate actions and support measures. As described in the project concept (PIF), this project aims to strengthen the existing institutional capacity and enable them to monitor, verify, and report relevant information pertaining to climate reporting, viz: GHG emissions; progress with climate actions as appropriated under NDCs; capacity-needs, gaps, constraints; and corresponding support received and required.",
    "how_to_apply": "https://www.glassdoor.com/job-listing/individual-consultant-national-climate-change-and-transparency-expert-undp-JV_IC1132348_KO0,69_KE70,74.htm?jl=3281372748&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "company_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTwXVoEBxe_1SGgUEkCqcGHjWbJU64YAojjKdOaFI1QIskAoT75BJH0wg"
  },
  {
    "id": "cdd3b306-ded1-11e8-9d57-a9ea0396f64e2",
    "type": "Full Time",
    "url": "https://www.google.com/search?q=climate+change+jobs&oq=climate+change+jobs&aqs=chrome..69i57j69i60j0l4.4935j1j4&sourceid=chrome&ie=UTF-8&ibp=htl;jobs&sa=X&ved=2ahUKEwj0rdft_KXjAhUitlkKHYjKBa0QiYsCKAF6BAgJEBA#fpstate=tldetail&htidocid=2fHq9ggQaB-TxDsUAAAAAA%3D%3D&htivrt=jobs",
    "created_at": "Fri Nov 02 19:02:51 UTC 2018",
    "company": "Pace University",
    "company_url": "https://www.pace.edu/",
    "location": "New York, NY",
    "title": "Executive Director, Energy/Climate Center",
    "description": "The Executive Director leads the Center’s experienced and multi-disciplinary team and its students. The Executive Director is involved as a part of the environmental program at Pace Law School’s top-ranked environmental law program. He or she will also serve as the central point of contact between the Center and the broader university. The Executive Director will be based at the Elisabeth Haub Law School campus in White Plains, New York, with some travel required (including occasional trips to Albany, New York City, and throughout the Northeast). He or she will report directly to the Law School Dean.",
    "how_to_apply": "https://www.glassdoor.com/job-listing/executive-director-energy-climate-center-pace-university-JV_IC1132373_KO0,40_KE41,56.htm?jl=3245606043&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "company_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRZd1pajn4LQOKmXbH8R7dV16BHGOKfONG4rp4SAsilBKxF20FoVnmyNg"
  },
  {
    "id": "cdd3b306-ded1-11e8-9d57-a9ea0396f64e3",
    "type": "Full Time",
    "url": "https://www.google.com/search?q=climate+change+jobs&oq=climate+change+jobs&aqs=chrome..69i57j69i60j0l4.4935j1j4&sourceid=chrome&ie=UTF-8&ibp=htl;jobs&sa=X&ved=2ahUKEwj0rdft_KXjAhUitlkKHYjKBa0QiYsCKAF6BAgJEBA#fpstate=tldetail&htidocid=2fHq9ggQaB-TxDsUAAAAAA%3D%3D&htivrt=jobs",
    "created_at": "Fri Nov 02 19:02:51 UTC 2018",
    "company": "Vox Media",
    "company_url": "http://www.voxmedia.com/",
    "location": "New York, NY",
    "title": "Science Reporter",
    "description": "We’re looking for a reporter who can cover the environment beat, OR the health and technology beat. For the former, we’re looking for someone who is passionate about environmental sciences and who wants to tell stories that aren't being told elsewhere. We want to focus on what industries will boom as climate change roils the world, what daily habits will change, and how that will connect with people. Climate change is ultimately a human problem — so what does that mean for people now? Do you jump at the chance to cover how the environment affects human life, and how it will reshape our day-to-day? Do you want to cover disasters, recovery, and prevention? Are you interested in finding out how we can protect the most vulnerable from the unexpected?",
    "how_to_apply": "https://www.glassdoor.com/job-listing/science-reporter-vox-media-JV_IC1132348_KO0,16_KE17,26.htm?jl=3205957429&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "company_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQIELdpGMD65C268KJlpNtw7QJxvHtHb1ClCpqUdJD5QyNcWaiupx_1jQ"
  },
  {
    "id": "cdd3b306-ded1-11e8-9d57-a9ea0396f64e4",
    "type": "Full Time",
    "url": "https://www.google.com/search?q=climate+change+jobs&oq=climate+change+jobs&aqs=chrome..69i57j69i60j0l4.4935j1j4&sourceid=chrome&ie=UTF-8&ibp=htl;jobs&sa=X&ved=2ahUKEwj0rdft_KXjAhUitlkKHYjKBa0QiYsCKAF6BAgJEBA#fpstate=tldetail&htidocid=2fHq9ggQaB-TxDsUAAAAAA%3D%3D&htivrt=jobs",
    "created_at": "Fri Nov 02 19:02:51 UTC 2018",
    "company": "New York City Department Of Parks And Recreation",
    "company_url": "https://www.nycgovparks.org/",
    "location": "New York, NY",
    "title": "Freshkills Park Climate Change Intern",
    "description": "The Climate Change intern will be responsible for researching opportunities for Freshkills Park to participate in and be informed by current local, regional, and global climate change research projects. Working with staff, the intern will develop a roadmap for future climate change research program development, explore funding opportunities to support our work in contributing to these missions, and incorporate the research into the Park's outreach and education initiatives. This may be in the form of blog post contributions, the addition of information to school trips, among others.",
    "how_to_apply": "https://www.internships.com/posting/bug_38513920598?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "company_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRoebyN4_ULXRy6Tv8mF4sraoku4Ojn4EMlrLOFMlhyFpUsNN3CIBQ"
  }
]
