[
  {
    "id": "056ce8a5-7520-448a-a0a6-fa954bb6e1f2",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/056ce8a5-7520-448a-a0a6-fa954bb6e1f2",
    "created_at": "Thu Jun 13 20:38:32 UTC 2019",
    "company": "BentoBox",
    "company_url": "https://getbento.com/",
    "location": "New York, NY",
    "title": "Senior Software Engineer",
    "description": "\u003cp\u003eBentoBox puts restaurants online. We are transforming the hospitality industry by helping restaurants stay at the forefront of technology. Our simple and integrated platform gives restaurants industry-specific tools to manage their website and digital operations, delivered in a SaaS model. BentoBox powers industry leaders such as The Meatball Shop, Joseph Leonard, Union Square Hospitality Group, Major Food Group, Rose’s Luxury, Eleven Madison Park \u0026amp; many more. Learn more at \u003ca href=\"http://www.getbento.com\"\u003ewww.getbento.com\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eWe’re looking for a senior software engineer to help build the world’s best digital operations platform for restaurants. Our current technology stack consists mostly of Django / Python and React, but we are always looking to use the tools that are most appropriate for the task at hand.\u003c/p\u003e\n\u003cp\u003eResponsibilities\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWork with designers, product managers, and other engineers to implement new features on our platform\u003c/li\u003e\n\u003cli\u003eContribute clean, clear, high quality production code\u003c/li\u003e\n\u003cli\u003eHelp the product and design team work through the product specification, design and feasibility process\u003c/li\u003e\n\u003cli\u003eContribute unit and integration tests for new and existing features\u003c/li\u003e\n\u003cli\u003eProvide effective and constructive feedback on other engineer’s contributions\u003c/li\u003e\n\u003cli\u003eResearch and recommend new technologies, help set best practices and coding standards\u003c/li\u003e\n\u003cli\u003eUphold BentoBox’s core mission, vision, and values\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSkills and Attributes\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e4+ years of experience writing production code\u003c/li\u003e\n\u003cli\u003eSome experience with writing code within the context of a web based framework such as Django or Rails\u003c/li\u003e\n\u003cli\u003eA strong understanding of Javascript fundamentals\u003c/li\u003e\n\u003cli\u003eSome level of experience with React (with or without Redux)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBenefits\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCompetitive salary and equity\u003c/li\u003e\n\u003cli\u003eHealth insurance, including vision and dental\u003c/li\u003e\n\u003cli\u003eFlexible vacation plan\u003c/li\u003e\n\u003cli\u003eFriday lunches\u003c/li\u003e\n\u003cli\u003eCulture perks like dinners at BentoBox customers, cocktail classes, etc.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003ePlease share with us why you’re interested in this position. Include a link to your Github account, or any other public code samples you’d like to share with us.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003ePlease apply by submitting your application using this link: \u003ca href=\"https://grnh.se/9b0db74f2\"\u003ehttps://grnh.se/9b0db74f2\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcnRwIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--de5106947fdc894d8b0ecfc306bd86aa74d02651/bentobox-logo-220px.png"
  },
  {
    "id": "10e61b1c-1d2b-43ed-bf5d-c261020378f1",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/10e61b1c-1d2b-43ed-bf5d-c261020378f1",
    "created_at": "Tue Jun 04 19:53:36 UTC 2019",
    "company": "Knotch",
    "company_url": "https://www.knotch.it",
    "location": "New York City",
    "title": "Senior Full Stack Engineer",
    "description": "\u003cp\u003e\u003cstrong\u003eEngineering at Knotch:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eKnotch is the independent standard for content marketing ROI. We help CMOs and their teams measure and impact the outcome of their content efforts via real-time, actionable intelligence across all of their content investment. Our end-to-end content intelligence platforms helps marketers plan, measure, optimize and benchmark their content efforts across all owned and paid strategies. We work exclusively with brands and we do not monetize from any distribution channels to make sure that our business model isn’t invested in the success of what we are measuring.We’re based in SoHo, NYC and work with brands including: JP Morgan Chase \u0026amp; Co., Sprint, TD Ameritrade, Ford, Salesforce, Walmart, HP, Citi and AT\u0026amp;T. Knotch is proud to have been named to both \u003ca href=\"https://www.inc.com/best-workplaces-2019.html\"\u003eInc.'s Best Places to Work\u003c/a\u003e 2018 \u0026amp; 2019 and \u003ca href=\"https://www.builtinnyc.com/companies/best-places-to-work-nyc-2019\"\u003eBuilt In NYC's Best Places to Work\u003c/a\u003e 2018 \u0026amp; 2019!\u003c/p\u003e\n\u003cp\u003eEngineering is the cornerstone of our organization and we work hard everyday to build the most impactful products as possible. We love to experiment, find a deep joy in product iteration, achieve stability with thoughtful architecture and testing all while monitoring our performance and progress at every step.\u003c/p\u003e\n\u003cp\u003eKnotch’s founding mission has always been to improve the advertising and marketing industries in a lasting and meaningful way. Transparency through data is our ethos and something every member of our company takes seriously. We are looking for highly motivated engineers who passionate about data and who are eager to transform an industry to join us on our journey.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSenior Full Stack Engineer:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAt Knotch, data is at the heart of what we do. We receive millions of web requests a day, process insights in real-time, and store gigabytes worth of information. Well designed architectures, simple yet effective software implementations, and smart execution have been the keys to our success thus far. We’re looking for engineers who embrace these aspects and who are eager to contribute on all levels of our products.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat You'll Do at Knotch:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWrite elegant and expressive Ruby and Javascript for our various backend services and frontend applications\u003c/li\u003e\n\u003cli\u003eWork with our Front-end Engineers to design APIs and deliver data\u003c/li\u003e\n\u003cli\u003eWork with our Client team to understand bottlenecks and improve our overall value\u003c/li\u003e\n\u003cli\u003eWork with our Product team to iterate on features and innovate with new product concepts\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat We Want From You:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e4 years+ of Web Application engineering and architecture experience\u003c/li\u003e\n\u003cli\u003eStrong experience with \u003cstrong\u003eRuby, Rails, Python, Postgres, and Docker\u003c/strong\u003e\n\u003c/li\u003e\n\u003cli\u003eStrong experience with various \u003cstrong\u003eAWS\u003c/strong\u003e offerings such as \u003cstrong\u003eEC2, ECS, RDS, S3, ElastiCache, Lambda\u003c/strong\u003e and others\u003c/li\u003e\n\u003cli\u003eStrong Experience with modern ES6+ \u003cstrong\u003eJavaScript\u003c/strong\u003e and using \u003cstrong\u003eReact\u003c/strong\u003e\n\u003c/li\u003e\n\u003cli\u003eAn eagerness to experiment, a determination to contribute, and a drive to recognize problems and swiftly remedy them\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eUnlimited PTO and flexible work-from-home\u003c/li\u003e\n\u003cli\u003eComprehensive health insurance\u003c/li\u003e\n\u003cli\u003eFree lunch while in-office\u003c/li\u003e\n\u003cli\u003eUnlimited monthly Metrocard\u003c/li\u003e\n\u003cli\u003eMental Health and Learning \u0026amp; Development Programs\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\u003c/strong\u003e\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eIf this sounds like the right role for you, then we're eager to hear from you! Apply directly through this link: \u003ca href=\"https://grnh.se/0e8358931\"\u003ehttps://grnh.se/0e8358931\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eMake sure to have your GitHub profile link handy.\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ1pwIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3aafdec37c9f39a7012be59c0ab98fa6b7c05606/KnotchAvatar.png"
  },
  {
    "id": "7b0278ca-0180-435b-9a13-913a6668390a",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/7b0278ca-0180-435b-9a13-913a6668390a",
    "created_at": "Tue Jun 04 19:45:53 UTC 2019",
    "company": "Knotch",
    "company_url": "https://www.knotch.it",
    "location": "New York City",
    "title": "Data Platform Engineer",
    "description": "\u003cp\u003e\u003cstrong\u003eAbout Knotch:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eKnotch is the independent standard for content marketing ROI. We help CMOs and Marketing teams measure and impact the outcome of their content efforts via real-time, actionable intelligence across all of their content investment.\u003c/p\u003e\n\u003cp\u003eOur Intelligence Platform for Brands helps marketers plan, measure, optimize and benchmark their content efforts across all owned and paid strategies. We work exclusively with brands and we do not monetize from any distribution channels to make sure that our business model isn’t invested in the success of what we are measuring.\u003c/p\u003e\n\u003cp\u003eWe’re based in SoHo, NYC and work with brands including JP Morgan Chase \u0026amp; Co., Sprint, TD Ameritrade, Ford, Salesforce, Walmart, HP, Citi and AT\u0026amp;T. Knotch is proud to have been named to both \u003ca href=\"https://www.inc.com/best-workplaces-2019.html\"\u003eInc.'s Best Places to Work\u003c/a\u003e 2018 \u0026amp; 2019 and \u003ca href=\"https://www.builtinnyc.com/companies/best-places-to-work-nyc-2019\"\u003eBuilt In NYC's Best Places to Work\u003c/a\u003e 2018 \u0026amp; 2019!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eEngineering at Knotch:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eEngineering is the cornerstone of our organization and we work hard every day to build the most impactful products as possible. We love to experiment, find a deep joy in product iteration, achieve stability with thoughtful architecture and testing all while monitoring our performance and progress at every step.\u003c/p\u003e\n\u003cp\u003eKnotch’s founding mission has always been to improve the advertising and marketing industries in a lasting and meaningful way. Transparency through data is our ethos and something every member of our company takes seriously. We are looking for highly motivated engineers who passionate about data and who are eager to transform an industry to join us on our journey.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eData Platform Engineering:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAt Knotch, our data platform is vital to providing key intelligence and insights to our clients. As a result, our data platform is the most important element when it comes to successfully scaling our products and technologies. As our platform evolves, agility with stability are critical to avoid bottlenecks in our products and to ultimately increase our value. We’re looking for an experienced data engineer who deeply values clever platform architecture and who emphasizes speed and stability to join our growing team.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat You'll Do at Knotch:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesign and implement resilient backend architectures that process gigabytes and beyond\u003c/li\u003e\n\u003cli\u003eWrite software for backend services using Ruby, Python, and other languages\u003c/li\u003e\n\u003cli\u003eWork directly with our Data Science team facilitate new understandings and insights from our data\u003c/li\u003e\n\u003cli\u003eWork directly with our full-stack engineering team to expose value from our data\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat We Want From You:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e3+ years of data platform engineering experience\u003c/li\u003e\n\u003cli\u003eWorking experience with AWS services including Kinesis, Lambda, S3, and RedShift\u003c/li\u003e\n\u003cli\u003eExperience with various AWS offerings such as EC2, ECS, RDS, ElastiCache, and others\u003c/li\u003e\n\u003cli\u003eExperience with Python, Ruby, JavaScript, Postgres, and Redis\u003c/li\u003e\n\u003cli\u003eExperience working with Data Science teams and productizing Data Science models and applications\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\u003c/strong\u003e\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eIf this sounds like the right role for you, then we're eager to hear from you! Apply directly through this link: \u003ca href=\"https://grnh.se/79e7edfe1\"\u003ehttps://grnh.se/79e7edfe1\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eMake sure to have your GitHub profile link handy.\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ1ZwIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--37770e8e536e17df2a02e3c37727c6222ef9b4f1/KnotchAvatar.png"
  },
  {
    "id": "45296f64-ec32-11e8-9e1b-5d24b20f1c0f",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/45296f64-ec32-11e8-9e1b-5d24b20f1c0f",
    "created_at": "Mon Nov 19 19:40:01 UTC 2018",
    "company": "Prosek Partners",
    "company_url": "https://www.prosek.com",
    "location": "Fairfield, CT",
    "title": "Front End Developer",
    "description": "\u003cp\u003eBackground\u003c/p\u003e\n\u003cp\u003eProsek Partners, one of the top 25 marketing communications and public relations companies in the U.S., is seeking a talented, versatile and motivated full-time Front End Developer to join our growing creative services team in Fairfield, Connecticut.\u003c/p\u003e\n\u003cp\u003eThe Front End Developer will take on a key role as we begin building our internal development team. The position will be responsible for developing and executing high-quality web productions for client related projects and occasional in-house programs. The ideal candidate would be at the center of the Prosek development team. They key area of focus will be building a best-in-class web-based UI/UX and requires extensive knowledge of web applications ecosystems. The Front End Developer will be part of a dynamic, evolving environment providing rapid delivery across multiple sectors for our varied clients, with a strong desire to lead change as we continue to build our agile transformational workflow. Along with these tasks, the professional we seek will also be a key participant in the creation of strategies and marketing campaigns for both our clients and internal stakeholders, and work on a variety of other projects collaborating with team members throughout our five offices in New York, Boston, Fairfield, Los Angeles and London.\u003c/p\u003e\n\u003cp\u003eTechnical skills:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesign overall architecture of web applications, while maintaining quality, code integrity and organization to ensure responsiveness of applications\u003c/li\u003e\n\u003cli\u003eUnderstanding of fundamental design principles behind scalable applications and participate in collaborative team efforts with responsive, user experience and user interface design\u003c/li\u003e\n\u003cli\u003eUnderstanding differences between multiple delivery platforms (such as mobile vs, desktop), and optimizing output to function on specific platforms\u003c/li\u003e\n\u003cli\u003eDelivering reusable components, code and front-end libraries for future use\u003c/li\u003e\n\u003cli\u003eTranslating designs and wireframes into high quality, tested code\u003c/li\u003e\n\u003cli\u003eExperience with interactive web elements and motion\u003c/li\u003e\n\u003cli\u003eAble to identify opportunities for process and tool improvements\u003c/li\u003e\n\u003cli\u003eProficient knowledge of front/back-end programming languages: HTML5, CSS3 and JavaScript are necessary, with in-depth understanding of DOM\u003c/li\u003e\n\u003cli\u003eUnderstanding of CSS pre- and post-processors\u003c/li\u003e\n\u003cli\u003eExperience working with third party services, APIs, and content management systems.\u003c/li\u003e\n\u003cli\u003eProficient in Adobe Creative Cloud including, but not limited to, Photoshop, Illustrator and InDesign\u003c/li\u003e\n\u003cli\u003eComprehensive awareness and interest in new technologies\u003c/li\u003e\n\u003cli\u003eUnderstanding of full-stack requirements and deployments\u003c/li\u003e\n\u003cli\u003eEnforce front-end code compliance with web for cross-browser and platform compatibility\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAs a Front End Developer, you will be expected to:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBe self-motivated, detail-oriented and confident\u003c/li\u003e\n\u003cli\u003eCapable of analyzing challenges and create on-brand design solutions that meet measurable business goals and requirements\u003c/li\u003e\n\u003cli\u003eTranslate ideas, end-user needs, design criteria, and technical features into quality web productions\u003c/li\u003e\n\u003cli\u003ePresent and defend technical recommendations to the team\u003c/li\u003e\n\u003cli\u003eAble to speak not just passionately about your work but also plainly to those who are inexperienced\u003c/li\u003e\n\u003cli\u003eHave a strong grasp of storytelling through layout and information design\u003c/li\u003e\n\u003cli\u003ePossess excellent written and verbal communication skills\u003c/li\u003e\n\u003cli\u003eBe comfortable with getting and giving feedback; be flexible and willing to learn and passionate about mentoring and collaborating with other designers\u003c/li\u003e\n\u003cli\u003eAble to work under tight deadlines, with little supervision\u003c/li\u003e\n\u003cli\u003eRise above the competition: tell us about your experience with mobile app development\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eRequirements:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBachelor's degree in computer science or related field\u003c/li\u003e\n\u003cli\u003e3-5 years of professional IT-related experience\u003c/li\u003e\n\u003cli\u003eDemonstrate a strong set of visual, written and oral communication skills, a meticulous eye for detail, and the ability to create work inspired by ideas and not trends\u003c/li\u003e\n\u003cli\u003eFluency in Adobe Creative Cloud is a must, with bonus points going to those who can function across Windows and OS X.\u003c/li\u003e\n\u003c/ul\u003e\n",
    "how_to_apply": "\u003cp\u003eEmail your resume to \u003ca href=\"mailto:developerjobs@prosek.com\"\u003edeveloperjobs@prosek.com\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUZYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--46d1fc63cd3c42af58e8eb57769e49386c3a54c6/56db6e1a-a723-4256-b184-6fc3e13db90a"
  },
  {
    "id": "fda26124-e9e7-11e8-9f44-4d0452dab2f9",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/fda26124-e9e7-11e8-9f44-4d0452dab2f9",
    "created_at": "Fri Nov 16 21:43:59 UTC 2018",
    "company": "The Franklin Report",
    "company_url": "http://www.franklinreport.com",
    "location": "New York, NY",
    "title": "Software Developer",
    "description": "\u003cp\u003eWe’re a hybrid company: a legacy media property with deep authority in our market, looking to create a disruptive piece of software in the job search space. We’re looking for hungry, smart developer to help us build it. You’d be collaborating with an existing team (one US based project lead, a small crew in India) to create the underlying database structure and business logic, and help polish the user interface.\u003c/p\u003e\n\u003cp\u003eExtensive work experience is not required. However, proficiency in the .NET platform is a must. Expertise in some but not all of the following languages is crucial:\nMVC.Net\nSQL Server\nC#\nJavascript\u003c/p\u003e\n\u003cp\u003ePreference will be given to candidates who can do at least some time in our Manhattan office. However, we are open to remote arrangements for the right fit (US only). The position will start as a part time arrangement, with room to grow into full-time.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eemail your resume to \u003ca href=\"mailto:fred@franklinerport.com\"\u003efred@franklinerport.com\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaEpYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--56f0ca505d4d7e7584c9c058903dd52c3275e3a0/e4139e25-14a3-48b4-9ab2-caa5f0a61165"
  },
  {
    "id": "d28b2d1a-e85a-11e8-9b78-62dc829f5516",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/d28b2d1a-e85a-11e8-9b78-62dc829f5516",
    "created_at": "Wed Nov 14 22:16:02 UTC 2018",
    "company": "The Atlantic",
    "company_url": "http://theatlantic.com",
    "location": "Washington, DC \u0026 New York, NY",
    "title": "Lead Front End Developer",
    "description": "\u003cp\u003eThe Atlantic is a digital-first media company with over 160 years of history and 36 million readers a month. Founded in 1857 and today one of the fastest-growing media platforms in the industry, The Atlantic has throughout its history championed the power of big ideas and continues to shape global debate through our two websites: TheAtlantic.com and CityLab.com. We work in a fast-paced, team-oriented environment out of our office in the historic Watergate complex in Washington DC. This role can be based in either Washington, DC or New York, NY.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWho You Are\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou are an experienced developer with proven leadership and management experience.\u003c/p\u003e\n\u003cp\u003eYou are well versed in the modern front-end, and can mentor junior members of the team on the latest best practices concerning ES6, SCSS, and performance. You know how to collaborate with designers, are knowledgeable about CSS conventions and naming methodologies such as BEM, SMACSS, OOCSS, and can describe their relative merits.\u003c/p\u003e\n\u003cp\u003eYour experience has taught you the architectural strategies and practices that are necessary for organizing and maintaining front end code that can scale as our team continues to grow. You know how to evaluate new technology and determine which path will best fit our business needs.\u003c/p\u003e\n\u003cp\u003eAbove all, you’re a creative problem solver: able to devise and deliver practical, maintainable software that addresses Atlantic staffers’ and readers’ needs.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePrimary Responsibilities\u003c/strong\u003e:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eProvide feedback and mentorship to the front end team through weekly one-on-one check as well as mid and end of the year reviews\u003c/li\u003e\n\u003cli\u003eHelp plan and execute team and individual goals, with an eye on team growth and development\u003c/li\u003e\n\u003cli\u003eChampion ways to improve our front end tech stack, including tooling, unit testing, and architecture\u003c/li\u003e\n\u003cli\u003eCollaborate with team members to plan projects, creating technical road maps and breaking projects up into individual tasks as necessary while always keeping in mind long term maintainability\u003c/li\u003e\n\u003cli\u003eAct as a role model to others on the team by exhibiting strong work ethic and technical expertise when writing code or building new website features\u003c/li\u003e\n\u003cli\u003eAct as a expert who can provide technical help and guidance to the other front end developers\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eProven experience with technical leadership and management\u003c/li\u003e\n\u003cli\u003eExperience architecting a front end codebase at scale\u003c/li\u003e\n\u003cli\u003eStrong technical and non-technical communication skills\u003c/li\u003e\n\u003cli\u003eAble to look at a design and break it into well organized reusable components\u003c/li\u003e\n\u003cli\u003eExperience planning, ticketing, and executing team projects\u003c/li\u003e\n\u003cli\u003eComfortable with Git for version control\u003c/li\u003e\n\u003cli\u003eEffective time management when working on multiple projects\u003c/li\u003e\n\u003cli\u003ePassionate about front end performance with up-to-date knowledge of current techniques\u003c/li\u003e\n\u003cli\u003eFamiliar with Node.js and modern frontend build tooling\u003c/li\u003e\n\u003cli\u003eKnowledgeable about modern JavaScript frameworks but comfortable working in Vanilla JS\u003c/li\u003e\n\u003cli\u003eAble to provide a code sample demonstrating expertise at writing and organizing CSS, HTML, and - JavaScript suitable for a complex, fast-changing website\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eEmployees at The Atlantic are entitled to benefits including: 401(k) savings plan with employer match, health care with domestic partner coverage, flexible vacation and sick leave policy, commuter benefits, and rooftop happy hours with one of the best views in DC.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAtlantic Media Values\u003c/strong\u003e:\u003c/p\u003e\n\u003cp\u003eAcross Atlantic Media, generally, the firm looks for two “pillar gifts” in you, and everyone else.  In all of us, these are more aspirational than actual, but they are central in our intentions –\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003eForce of Ideas\u003c/strong\u003e: At the center of Atlantic Media work are the ideas within our writing. We believe that ideas – to the good and not – have consequence. Our highest work is bringing rigor, insight, intellectual integrity, to that ultimate purpose of separating the bad from the good, and giving voice to the latter.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eSpirit of Generosity\u003c/strong\u003e: Atlantic Media seeks in its ranks those with natural disposition toward service and selfless conduct. Atlantic Media writing should be cut from the same cloth – critical on the merits, but informed by charity and forbearance in measuring motive and personal character.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003eAtlantic Media is an EOE of Minorities/Women/Vets/Disability\u003c/em\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003ePursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003c/em\u003e\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eApply online: \u003ca href=\"https://atlanticmedia.theresumator.com/apply/b6ZvfSoePV/Lead-Front-End-Developer?source=Github\"\u003ehttps://atlanticmedia.theresumator.com/apply/b6ZvfSoePV/Lead-Front-End-Developer?source=Github\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdFZXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b5696c45ec9ba49ead9190535e55a9e2ca213021/dda99823-bc1b-4669-800b-48e3971f2d37"
  },
  {
    "id": "0e9e93a6-e85a-11e8-8963-f68a643e24dd",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/0e9e93a6-e85a-11e8-8963-f68a643e24dd",
    "created_at": "Wed Nov 14 22:11:05 UTC 2018",
    "company": "The Atlantic",
    "company_url": "http://theatlantic.com",
    "location": "Washington, DC \u0026 New York, NY",
    "title": "Senior Front End Developer",
    "description": "\u003cp\u003eThe Atlantic is a digital-first media company with over 160 years of history and 36 million readers a month. Founded in 1857 and today one of the fastest-growing media platforms in the industry, The Atlantic has throughout its history championed the power of big ideas and continues to shape global debate through our two websites: TheAtlantic.com and CityLab.com. We work in a fast-paced, team-oriented environment out of our office in the historic Watergate complex in Washington DC. The role can be based in either Washington, DC or New York, NY.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWho You Are\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou are an experienced developer and solid communicator with an interest in journalism and the media business.\u003c/p\u003e\n\u003cp\u003eYou’re well versed in the modern front-end: ES6, SCSS, understand what makes good markup, and how to best use the capabilities of the browser. You know how to collaborate with designers, are knowledgeable about CSS conventions and naming methodologies such as BEM, SMACSS, OOCSS, and can describe their relative merits. Your experience has taught you the architectural strategies and practices that are necessary for organizing and maintaining front end code that can scale as our team continues to grow.\u003c/p\u003e\n\u003cp\u003eAbove all, you’re a creative problem solver: able to devise and deliver practical, maintainable software that addresses Atlantic staffers’ and readers’ needs.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePrimary Responsibilities:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eImplement new features for TheAtlantic.com and CityLab.com where they will be viewed by millions of people\u003c/li\u003e\n\u003cli\u003eChampion ways to improve our front end tech stack, including tooling, unit testing, and architecture\u003c/li\u003e\n\u003cli\u003eCollaborate with team members to plan projects, creating technical road maps and breaking projects up into individual tasks as necessary\u003c/li\u003e\n\u003cli\u003eMentor junior developers and act as a subject expert\u003c/li\u003e\n\u003cli\u003eThinks strategically and systematically when planning or coding a project, always keeping in mind long term maintainability\u003c/li\u003e\n\u003cli\u003eWork to continually reduce our front end website load time\u003c/li\u003e\n\u003cli\u003eCommunicate and collaborate with both technical and non-technical members of the team\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements:\u003c/strong\u003e\n-Experience architecting a front end codebase at scale\n-Strong technical and non-technical communication skills\n-Able to write semantic and accessible markup that our growing team can easily maintain and iterate with\n-Able to look at a design and break it into well organized reusable components\n-Comfortable with Git for version control\n-Effective time management when working on multiple projects\n-Passionate about front end performance with up-to-date knowledge of current techniques\n-Familiar with Node.js\n-Knowledgeable about modern JavaScript frameworks but comfortable working in vanilla JS as appropriate\n-Able to provide a code sample demonstrating expertise at writing and organizing CSS, HTML, and JavaScript suitable for a complex, fast-changing website\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eEmployees at The Atlantic are entitled to benefits including: 401(k) savings plan with employer match, health care with domestic partner coverage, flexible vacation and sick leave policy, commuter benefits, and rooftop happy hours with one of the best views in DC.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAtlantic Media Values:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAcross Atlantic Media, generally, the firm looks for two “pillar gifts” in you, and everyone else.  In all of us, these are more aspirational than actual, but they are central in our intentions –\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003eForce of Ideas\u003c/strong\u003e: At the center of Atlantic Media work are the ideas within our writing. We believe that ideas – to the good and not – have consequence. Our highest work is bringing rigor, insight, intellectual integrity, to that ultimate purpose of separating the bad from the good, and giving voice to the latter.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eSpirit of Generosity\u003c/strong\u003e: Atlantic Media seeks in its ranks those with natural disposition toward service and selfless conduct. Atlantic Media writing should be cut from the same cloth – critical on the merits, but informed by charity and forbearance in measuring motive and personal character.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003eAtlantic Media is an EOE of Minorities/Women/Vets/Disability.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003ePursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eApply online: \u003ca href=\"https://atlanticmedia.theresumator.com/apply/EfTMcPw1rG/Senior-Front-End-Developer?source=Github\"\u003ehttps://atlanticmedia.theresumator.com/apply/EfTMcPw1rG/Senior-Front-End-Developer?source=Github\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdEpXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d395d665d7dd3f82d64d22e06b39f41ba13e36c9/f749e401-94c5-477e-8c8b-fb68335e240b"
  },
  {
    "id": "dc428b94-e42e-11e8-91e2-23879ca9e8b0",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/dc428b94-e42e-11e8-91e2-23879ca9e8b0",
    "created_at": "Fri Nov 09 14:51:11 UTC 2018",
    "company": "New York University",
    "company_url": null,
    "location": "New York, New York 10001",
    "title": "Technology Solutions Developer",
    "description": "\u003cp\u003eAs a member of the Technology Development Group, the Technology Solutions Developer is responsible for designing, implementing, and testing a wide variety of web applications, and supporting the School of Law's web presence, including academic and administrative functions. The responsibilities range from designing and developing end-to-end applications, planning and developing new site features, and extending existing applications to keeping web systems up-to-date, and integrating 3rd party applications with the school's application stack. The role requires excellent technical skills, analytical and creative problem solving skills, an ability to work independently or with a group, initiative, and high personal standards for quality work.\u003c/p\u003e\n\u003cp\u003eUS\u003c/p\u003e\n\u003cp\u003eThe Technology Development Group at NYU School of Law is a small, versatile, full stack development team. The vast majority of our development is in C#/.NET, with additional projects in PHP (Laravel) … both using Vue as our front-end framework.\u003c/p\u003e\n\u003cp\u003eOur group develops and supports the school's website (Drupal), micro sites (usually WordPress), reporting, and administrative applications (both internal and public). We've been known to divert our energies towards improving our supporting infrastructure, and now run many of our services using Docker/Kubernetes/Terraform, and that only as part of our growing AWS presence. We're usually getting ourselves into trouble with interesting projects.\u003c/p\u003e\n\u003cp\u003eYOU\u003c/p\u003e\n\u003cp\u003eWe're looking to add a developer who is flexible enough to code across different environments. Maybe you have experience in another language and are looking to switch it up. You're already good, but want to be better … and you want to learn new things and grow. Regardless, have an opinion, because we genuinely want to hear it!\u003c/p\u003e\n\u003cp\u003eWHY\u003c/p\u003e\n\u003cp\u003eAs an employee of NYU Law, you would receive NYU's benefits (\u003ca href=\"https://www.nyu.edu/employees/benefit.html\"\u003ehttps://www.nyu.edu/employees/benefit.html\u003c/a\u003e), including excellent health coverage, retirement plans, and tuition remission. You would be part of a team of creative, talented technologists who continue to make NYU Law one of the top law schools in the country! Finally, you will be given the opportunity to become the professional you want to be, working with the tools you want to work with.\u003c/p\u003e\n\u003cp\u003eRequired Education:\nBachelor's degree.\u003c/p\u003e\n\u003cp\u003eRequired Experience:\n2-4 years' experience and expertise in working with high level languages such as: C#, PHP, Python, or Ruby; fluency in HTML, CSS, JavaScript; and familiarity with the general principles of system and network administration; direct experience with the all components of the LAMP stack and content management frameworks, such as Drupal and WordPress.\u003c/p\u003e\n\u003cp\u003ePreferred Experience:\nExperience with a web development framework such as: .NET, Laravel, Django, or Rails. Experience with a JavaScript framework such as Vue, Angular, or React.\u003c/p\u003e\n\u003cp\u003eRequired Skills, Knowledge and Abilities:\nExcellent interpersonal and communication skills; ability and drive to learn new technologies and proactively look for ways to improve the School of Law's applications and web infrastructure.\u003c/p\u003e\n\u003cp\u003ePreferred Skills, Knowledge and Abilities:\nKnowledge of module or plugin development for these frameworks is a plus. Fundamental knowledge of distributed version control systems and familiarity with one or more contemporary version control systems (e.g. Git/Mercurial/SVN)\u003c/p\u003e\n\u003cp\u003eEOE/AA/Minorities/Females/Vet/Disabled/Sexual Orientation/Gender Identity\u003c/p\u003e\n\u003cp\u003eApply Here: \u003ca href=\"http://www.Click2apply.net/cyg9sy9m99zdm9v2\"\u003ehttp://www.Click2apply.net/cyg9sy9m99zdm9v2\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePI105491972\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eApply Here: \u003ca href=\"http://www.Click2apply.net/cyg9sy9m99zdm9v2\"\u003ehttp://www.Click2apply.net/cyg9sy9m99zdm9v2\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": null
  },
  {
    "id": "fa15462c-e201-11e8-9ee9-cfbf28397977",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/fa15462c-e201-11e8-9ee9-cfbf28397977",
    "created_at": "Tue Nov 06 20:25:06 UTC 2018",
    "company": "Constructive",
    "company_url": "http://constructive.co",
    "location": "New York, New York",
    "title": "Sr. Web Developer (Full-Stack/WP), Social Change Design Agency",
    "description": "\u003cp\u003e\u003cstrong\u003eSr. Web Developer (Full-Stack/WP), Digital Agency for Social Change\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eConstructive, a leading brand experience design \u0026amp; digital design agency that works exclusively with social impact organizations is looking for an outstanding technical expert and creative thinker to join our team as a Sr. Web Developer.\u003c/p\u003e\n\u003cp\u003eIf you’re an experienced technologist who has demonstrated expertise building Wordpress websites that demand a high degree of creative and technical complexity, thrive on being a collaborative problem solver, and believe that the best digital experiences happen when strategy, technology, and design work together, then we’d love to hear from you. And if you care deeply about issues like climate change, social justice, and economic equality—and want to work on interesting projects that make a meaningful positive impact on them—then we think you’ll love working with us and our clients.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eA bit about the role\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSr. Web Developers at Constructive need great expertise both in creating powerful back-end publishing systems and in elegant front-end digital experiences. They need to write code that’s semantically sound and adheres to current best practices. They must be proactive thinkers who are always looking to bring new ideas to the table and improve how we work. And they must thrive on working collaboratively in multi-disciplinary teams.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eA bit about us\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe’re a diverse, close-knit bunch who are serious about having fun producing exceptional work. We play to win—for our clients, for ourselves, and for the world. We’ve got each other’s backs. We have high expectations and the work ethic to match them. And we’re all together in the same open office, so there’s music and a lot of joking mixed-in with being heads-down on work.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eA bit about diversity\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe believe strongly that diversity is one of our greatest strengths—that the more perspectives we bring to the mix, the better we are as people and the better partner we are for our clients. So, in considering if Constructive is a good fit for you, know that all we care about is that you’re qualified to do the job, share most or all of our values, and want to be here. These are the things we’ll be evaluating for every applicant.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat we need you to do extremely well\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe’re looking for a developer who’s eager to play a leading role in Constructive’s digital practice. We’ll need you to have strong demonstrated success having done all or most of the following things for at least 3-5 years—and a passion for doing them extremely well.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eUnderstand the web development landscape, contributing significantly to creating internal technology strategies that align with broader brand strategy.\u003c/li\u003e\n\u003cli\u003eCollaborate across teams to plan and execute ambitious digital projects.\u003c/li\u003e\n\u003cli\u003eDevelop backend and frontend, taking ownership of your projects from start to finish.\u003c/li\u003e\n\u003cli\u003eParticipate in QA/UAT testing to ensure that what we deliver is what we promised—and that it lives up to our standards.\u003c/li\u003e\n\u003cli\u003eDocument your work to make it easier for other developers, both now and in the future, to work with what you’ve built.\u003c/li\u003e\n\u003cli\u003eImprove best practices, recommend tools, and build technical frameworks that make our work more efficient, effective, and technically front-of-field.\u003c/li\u003e\n\u003cli\u003eContribute to ongoing development and support for existing websites.\u003c/li\u003e\n\u003cli\u003eContribute to developing proposals and estimates for projects you will be a lead developer.\u003c/li\u003e\n\u003cli\u003eBe a team player who has a bias towards listening, takes serious pride in their work, and is always looking for our process and results to be better the next time out.\u003c/li\u003e\n\u003cli\u003eHave a sense of humor. Seriously, life can be stressful enough these days.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eExpertise that’s important in our work\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eRight now, these are the specific technologies and tasks that are essential to our work (which we always remain open to evaluating and evolving). We’ll need you to have about 5 years of professional experience in most of these things.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExpert-level Wordpress Development (Min 3 years experience)\u003c/li\u003e\n\u003cli\u003eExpert CSS chops (and SCSS!)\u003c/li\u003e\n\u003cli\u003eStrong front-end development experience (experience with at least 1 Javascript framework: React, Angular, Vue)\u003c/li\u003e\n\u003cli\u003eStrong preprocessor experience (Webpack / Gulp)\u003c/li\u003e\n\u003cli\u003eStrong Git experience\u003c/li\u003e\n\u003cli\u003eExperience with MySQL\u003c/li\u003e\n\u003cli\u003eExperience executing third-party integrations (Salesforce, Mailchimp, Blackbaud, Fluxx, Google Maps API, etc.)\u003c/li\u003e\n\u003cli\u003eComfortable with D3\u003c/li\u003e\n\u003cli\u003eComfortable with AWS\u003c/li\u003e\n\u003cli\u003eComfortable with Server Administration \u0026amp; DevOps\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat’s in it for you?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe do our best to make sure everyone at Constructive is taken care of with a great mix of salary, benefits and perks, opportunities for professional growth, and a healthy dose of time off. We also always reward individual initiative and outsized contributions to our collective success. Along with your base salary, here are the benefits and perks we have on tap at Constructive for 2018-2019 to add to this:\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits \u0026amp; Perks\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHealth, Dental \u0026amp; Vision Insurance\u003c/li\u003e\n\u003cli\u003e401K plan with 4% company match\u003c/li\u003e\n\u003cli\u003eAnnual profit sharing bonus+performance bonuses (no less than 10% of company profit split equally by all employees as profit sharing)\u003c/li\u003e\n\u003cli\u003e2 weeks paid vacation (+1 additional day per year)\u003c/li\u003e\n\u003cli\u003ePaid vacation between Christmas \u0026amp; New Year's\u003c/li\u003e\n\u003cli\u003e1/2-day Summer Fridays (Approx 16 days)\u003c/li\u003e\n\u003cli\u003e1 week paid personal/sick days\u003c/li\u003e\n\u003cli\u003eUnlimited work-from-home days (within reason!) after 6 months\u003c/li\u003e\n\u003cli\u003eMonthly employee-voted gift card awards\u003c/li\u003e\n\u003cli\u003eTransitChek (pay for transit w/ pre-tax $)\u003c/li\u003e\n\u003cli\u003eDiscounted Company Cell Phone Plan\u003c/li\u003e\n\u003cli\u003e$1K annual professional development stipend\u003c/li\u003e\n\u003cli\u003eNew client bonus (2.5% of largest contract in year 1 for any non-inbound client)\u003c/li\u003e\n\u003cli\u003eCoffee, healthy snacks, soda\u003c/li\u003e\n\u003cli\u003eCompany lunch every Wednesday\u003c/li\u003e\n\u003cli\u003eWeekly Happy Hr (every non-summer Friday)\u003c/li\u003e\n\u003cli\u003eBi-monthly Company Events (sporting events, bowling, holiday party, etc)\u003c/li\u003e\n\u003cli\u003eThe feeling of satisfaction knowing that your work is helping make the world a better place.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eInterested? Great! Then please send an email to titled “Senior Web Developer” to \u003ca href=\"mailto:jobs@constructive.co\"\u003ejobs@constructive.co\u003c/a\u003e with the following\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA resume\u003c/li\u003e\n\u003cli\u003eA cover letter telling us a bit about you and what excites you about joining our team\u003c/li\u003e\n\u003cli\u003eLinks to your own website, websites you’ve worked on, github, whatever\nDesired salary (freelance rate for those interested in consulting with us)\u003c/li\u003e\n\u003c/ul\u003e\n",
    "how_to_apply": "\u003cp\u003eInterested? Great! Then please send an email to titled “Senior Web Developer” to \u003ca href=\"mailto:jobs@constructive.co\"\u003ejobs@constructive.co\u003c/a\u003e with the following\u003c/p\u003e\n",
    "company_logo": null
  },
  {
    "id": "36bb2228-e201-11e8-9310-b526bfa5a16e",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/36bb2228-e201-11e8-9310-b526bfa5a16e",
    "created_at": "Tue Nov 06 20:19:44 UTC 2018",
    "company": "Cortex Building Intelligence",
    "company_url": "https://cortexintel.com/",
    "location": "New York, NY",
    "title": "Software Engineer, Full Stack (Rails, React)",
    "description": "\u003cp\u003e\u003cstrong\u003eCompany Description\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eCortex is a rapidly growing technology startup.  We provide software for Commercial Real Estate buildings that enables operators to run their buildings with significantly more precision.  This is creating substantial financial savings (up to $850k per year per building), while also having a significant sustainability impact (reducing energy use by 5-10% or the equivalent of taking 850 cars off the road).\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eJob Description\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAt Cortex, we are as proud of our pristine codebase as we are of our mission to create more sustainable cities. We accomplish this mission by using IoT data, Machine Learning, and modern web development to transform the way large buildings operate.  We are looking for a talented Software Engineer to work collaboratively with us to deliver amazing product experiences across all of our application’s channels including web, mobile, email and push notifications.  The Engineer in this role will have the opportunity to learn from an experienced team while accelerating their career with both guided and autonomous work.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eResponsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCreating new software product experiences that assist building operators in efficiently and effectively running their buildings by delivering our high impact Machine Learning recommendations through our web, mobile, email, and push notification channels.\u003c/li\u003e\n\u003cli\u003eIntegrating with third-party APIs to import utility company and building management system data to be used to feed our Machine Learning algorithms.\u003c/li\u003e\n\u003cli\u003eWorking closely with our Customer Success team to support client onboarding and operations.\u003c/li\u003e\n\u003cli\u003eTaking ownership of our Internal Tooling needs to allow our Customer Success team to scale their operational support of our clients.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eQualifications\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e4+ years of pragmatic, real-world experience creating, maintaining, testing, and deploying high-quality code to production systems.\u003c/li\u003e\n\u003cli\u003eStrong understanding of web development technologies, OOP languages, and relational databases.  We use Ruby with Rails, JavaScript with React, and Postgres.\u003c/li\u003e\n\u003cli\u003eExperience working with standard software engineering tools and practices such as version control, automated testing, and lightweight project management.  We use Git, RSpec, and Clubhouse.\u003c/li\u003e\n\u003cli\u003eProduct-focused.  Have the ability to understand the needs of our users and translate those needs into prioritized product features.\u003c/li\u003e\n\u003cli\u003eExcellent verbal and written communication skills.  Committed, hard-working, and thoughtful.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThe usual suspects: Competitive compensation/equity, commuter benefits, and access to Medical, HSA and 401k plans.\u003c/li\u003e\n\u003cli\u003eUnlimited paid time off.\u003c/li\u003e\n\u003cli\u003eYour choice of 13” or 15” Macbook Pro.\u003c/li\u003e\n\u003cli\u003eWork in an environment where clean code, automated testing, constructive code reviews, collaborative whiteboarding, thoughtful design, and easy deployments are considered to be the standard operating procedure.\u003c/li\u003e\n\u003c/ul\u003e\n",
    "how_to_apply": "\u003cp\u003eSchedule a time to chat with our CTO, Justin Spradlin: \u003ca href=\"https://calendly.com/justin-spradlin-cortex/chat-with-cortexs-cto\"\u003ehttps://calendly.com/justin-spradlin-cortex/chat-with-cortexs-cto\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbnBXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6ac4f10dc2db58c4f6c8bf99265e3afc94e0b305/8711ac77-126b-48d2-8caf-7c50a26ceb93"
  },
  {
    "id": "cdd3b306-ded1-11e8-9d57-a9ea0396f64e",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/cdd3b306-ded1-11e8-9d57-a9ea0396f64e",
    "created_at": "Fri Nov 02 19:02:51 UTC 2018",
    "company": "Jun Group",
    "company_url": "https://www.jungroup.com/",
    "location": "New York, NY",
    "title": "Senior Software Developer, Server-Side Technologies",
    "description": "\u003cp\u003eThe word JUN means truth, and our culture is about openness and honesty. Our mobile ad platform delivers millions of engagements across devices for clients like Intel, LG, Zynga, EA, and TechCrunch. These brands rely on us to reach their audience because everything we do is brand safe, viewable, and transparent.\u003c/p\u003e\n\u003cp\u003eWe are looking for a senior software engineer to join our amazing server team. This position is full-time, on-site in our New York headquarters, and will report to the Director of Server Software Development. Jun Group will only consider candidates for this position who are currently legally authorized to work in the United States.\u003c/p\u003e\n\u003cp\u003eWho you are\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou enjoy a fun, creative, and engaging working atmosphere free of brilliant jerks\u003c/li\u003e\n\u003cli\u003eYou want to be part of a small team inside a large company with massive opportunity for growth\u003c/li\u003e\n\u003cli\u003eYou enjoy collaboration with other teams including product, biz dev, and our in-house QA team\u003c/li\u003e\n\u003cli\u003eYou eagerly dig into complex engineering problems\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhat we do\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWrite scalable back-end and front-end code in JRuby, Java, and JavaScript\u003c/li\u003e\n\u003cli\u003eExperiment with new tech to find the right tool for the job\u003c/li\u003e\n\u003cli\u003eMaintain high code quality through code reviews and automated tests\u003c/li\u003e\n\u003cli\u003eUse Kanban to manage multiple releases per week\n-Participate in and improve Dev Ops for our primary revenue generating applications\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eHow we do it\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eRuby/Rails\u003c/li\u003e\n\u003cli\u003eJavaScript (JQuery, AngularJS, Vue.js)\u003c/li\u003e\n\u003cli\u003eIntelliJ IDEA / TeamCity\u003c/li\u003e\n\u003cli\u003eAWS (EC2, EB, RDS)\u003c/li\u003e\n\u003cli\u003eGoogle Cloud (BiqQuery, Dataflow, Cloud Functions)\u003c/li\u003e\n\u003cli\u003eMySQL\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhat we offer\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA highly competitive compensation package\u003c/li\u003e\n\u003cli\u003e401k with company match\u003c/li\u003e\n\u003cli\u003ePaid vacation, work from home, and sick days\u003c/li\u003e\n\u003cli\u003eAnnual personal development budget to attend a conference of your choice\u003c/li\u003e\n\u003cli\u003eDesignated time to work on the company-related projects you feel strongly about\u003c/li\u003e\n\u003cli\u003eMacbook Pros, dual monitors, and a quiet working space\u003c/li\u003e\n\u003cli\u003eCatered lunch at least once a week\u003c/li\u003e\n\u003cli\u003eMonthly company events\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eJun Group sets the standard for premium online advertising. We work hard, and we have lives, too. We'll pay top dollar for the right person, and there are plenty of perks. Interested parties should send a resume along with a cover note explaining why you’re right for the job.\u003c/p\u003e\n\u003cp\u003eTotal compensation is based on experience. We welcome diversity and non-traditional paths into the developer profession, and advocate strongly for hiring the right person as opposed to the right combination of keywords.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://grnh.se/06736d9f2\"\u003ehttps://grnh.se/06736d9f2\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbFZXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--726761e0459b97d7da1749cd58bef48691f6529f/f1729282-ab89-4940-8f76-77e7ad8e1cae"
  }
]
